coocox/Mplib/Toshaba/TPMP341/cmsis_lib/lib/inc/tmpm341_gpio.h
#define IS_GPIO_PA_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1))

#define IS_GPIO_PB_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2))

#define IS_GPIO_PC_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2)|| \
                                         ((param) == GPIO_FUNC_REG_3)|| \
                                         ((param) == GPIO_FUNC_REG_4))

#define IS_GPIO_PD_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2)|| \
                                         ((param) == GPIO_FUNC_REG_3))

#define IS_GPIO_PE_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2)|| \
                                         ((param) == GPIO_FUNC_REG_3)|| \
                                         ((param) == GPIO_FUNC_REG_4))

#define IS_GPIO_PF_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2)|| \
                                         ((param) == GPIO_FUNC_REG_3))

#define IS_GPIO_PG_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_2)|| \
                                         ((param) == GPIO_FUNC_REG_3)|| \
                                         ((param) == GPIO_FUNC_REG_4))

#define IS_GPIO_PH_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1)|| \
                                         ((param) == GPIO_FUNC_REG_2)|| \
                                         ((param) == GPIO_FUNC_REG_3)|| \
                                         ((param) == GPIO_FUNC_REG_4))

#define IS_GPIO_PI_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_1))

#define IS_GPIO_PJ_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_2)|| \
                                         ((param) == GPIO_FUNC_REG_3))

#define IS_GPIO_PK_FUNCTION_REG(param)  (((param) == GPIO_FUNC_REG_2)|| \
                                         ((param) == GPIO_FUNC_REG_3))

/** @} */
/* End of group GPIO_Parameter_Definition */

/** @defgroup GPIO_Bit_Define
  * @{
  */
#define GPIO_BIT_VALUE_1                ((uint8_t)0x01)
#define GPIO_BIT_VALUE_0                ((uint8_t)0x00)

#define IS_GPIO_BIT_VALUE(BitValue)     (((BitValue) == GPIO_BIT_VALUE_1)|| \
                                         ((BitValue) == GPIO_BIT_VALUE_0))

#define GPIO_BIT_0                      ((uint8_t)0x01)
#define GPIO_BIT_1                      ((uint8_t)0x02)
#define GPIO_BIT_2                      ((uint8_t)0x04)
#define GPIO_BIT_3                      ((uint8_t)0x08)
#define GPIO_BIT_4                      ((uint8_t)0x10)
#define GPIO_BIT_5                      ((uint8_t)0x20)
#define GPIO_BIT_6                      ((uint8_t)0x40)
#define GPIO_BIT_7                      ((uint8_t)0x80)
#define GPIO_BIT_ALL                    ((uint8_t)0xFF)

#define GPIO_PA_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PA_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PA_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PA_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PA_FR1_BIT_ALL                      ((uint8_t)0xFF)

#define GPIO_PB_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PB_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PB_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PB_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PB_FR1_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PB_FR2_BIT_ALL                      ((uint8_t)0xFF)

#define GPIO_PC_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PC_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PC_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PC_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PC_FR1_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PC_FR2_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PC_FR3_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PC_FR4_BIT_ALL                      ((uint8_t)0x44)

#define GPIO_PD_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PD_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PD_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PD_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PD_FR1_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PD_FR2_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PD_FR3_BIT_ALL                      ((uint8_t)0x8F)

#define GPIO_PE_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PE_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PE_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PE_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PE_FR1_BIT_ALL                      ((uint8_t)0x0F)
#define GPIO_PE_FR2_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PE_FR3_BIT_ALL                      ((uint8_t)0xFC)
#define GPIO_PE_FR4_BIT_ALL                      ((uint8_t)0x04)

#define GPIO_PF_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PF_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PF_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PF_INPUT_BIT_ALL                    ((uint8_t)0xFE)
#define GPIO_PF_FR1_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PF_FR2_BIT_ALL                      ((uint8_t)0x30)
#define GPIO_PF_FR3_BIT_ALL                      ((uint8_t)0x31)

#define GPIO_PG_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PG_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PG_OPEN_DRAIN_BIT_ALL               ((uint8_t)0xFF)
#define GPIO_PG_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PG_FR2_BIT_ALL                      ((uint8_t)0xFF)
#define GPIO_PG_FR3_BIT_ALL                      ((uint8_t)0xF7)
#define GPIO_PG_FR4_BIT_ALL                      ((uint8_t)0x40)

#define GPIO_PH_OUTPUT_BIT_ALL                   ((uint8_t)0x7F)
#define GPIO_PH_PULLUP_BIT_ALL                   ((uint8_t)0x7F)
#define GPIO_PH_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x7F)
#define GPIO_PH_INPUT_BIT_ALL                    ((uint8_t)0x7F)
#define GPIO_PH_FR1_BIT_ALL                      ((uint8_t)0x60)
#define GPIO_PH_FR2_BIT_ALL                      ((uint8_t)0x1F)
#define GPIO_PH_FR3_BIT_ALL                      ((uint8_t)0x18)
#define GPIO_PH_FR4_BIT_ALL                      ((uint8_t)0x04)

#define GPIO_PI_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PI_PULLUP_BIT_ALL                   ((uint8_t)0xDF)
#define GPIO_PI_PULLDOWN_BIT_ALL                 ((uint8_t)0x20)
#define GPIO_PI_OPEN_DRAIN_BIT_ALL               ((uint8_t)0x07)
#define GPIO_PI_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PI_FR1_BIT_ALL                      ((uint8_t)0xFF)

#define GPIO_PJ_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PJ_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PJ_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PJ_FR2_BIT_ALL                      ((uint8_t)0x80)
#define GPIO_PJ_FR3_BIT_ALL                      ((uint8_t)0xFF)

#define GPIO_PK_OUTPUT_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PK_PULLUP_BIT_ALL                   ((uint8_t)0xFF)
#define GPIO_PK_INPUT_BIT_ALL                    ((uint8_t)0xFF)
#define GPIO_PK_FR2_BIT_ALL                      ((uint8_t)0x0A)
#define GPIO_PK_FR3_BIT_ALL                      ((uint8_t)0x0F)

#define IS_GPIO_PA_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

#define IS_GPIO_PB_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

#define IS_GPIO_PC_DATA_BIT(param)      (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7))

